Revit 2026 API

# UIView Class

---

A class containing data about view windows in the Revit user interface.

SystemObject Autodesk.Revit.UIUIView

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class UIView : IDisposable
```
```vb
Public Class UIView
	Implements IDisposable
```
```cpp
public ref class UIView : IDisposable
```
```fsharp
type UIView =
    class
        interface IDisposable
    end
```

The UIView type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | ViewId | The id of the View associated with a UIView. |

|  | Name | Description |
| --- | --- | --- |
|  | Close | Closes the view. |
|  | Dispose | Releases all resources used by the UIView |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | GetWindowRectangle | Gets the rectangle containing the coordinates of the view's drawing area. |
|  | GetZoomCorners | Gets the corners of the view's rectangle. The two points that define the corners of the view's rectangle in model coordinates. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |
|  | Zoom | Zoom the view. |
|  | ZoomAndCenterRectangle | Zoom and center the view to a specified rectangle. |
|  | ZoomSheetSize | Zoom to the sheet size. |
|  | ZoomToFit | Zoom the view to fit its contents. |

#### Reference

Autodesk.Revit.UI Namespace